v2_TSEP/hx_sweep/LN2_3bar_Re10000/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }
simulationType RAS;
RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}
